{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Other",
    "1": "B-Date",
    "2": "M-Date",
    "3": "E-Date",
    "4": "S-Date",
    "5": "B-FromAddress",
    "6": "M-FromAddress",
    "7": "E-FromAddress",
    "8": "S-FromAddress",
    "9": "B-ToAddress",
    "10": "M-ToAddress",
    "11": "E-ToAddress",
    "12": "S-ToAddress",
    "13": "B-Type",
    "14": "M-Type",
    "15": "E-Type",
    "16": "S-Type",
    "17": "B-Type_Attr",
    "18": "M-Type_Attr",
    "19": "E-Type_Attr",
    "20": "S-Type_Attr"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Date": 1,
    "B-FromAddress": 5,
    "B-ToAddress": 9,
    "B-Type": 13,
    "B-Type_Attr": 17,
    "E-Date": 3,
    "E-FromAddress": 7,
    "E-ToAddress": 11,
    "E-Type": 15,
    "E-Type_Attr": 19,
    "M-Date": 2,
    "M-FromAddress": 6,
    "M-ToAddress": 10,
    "M-Type": 14,
    "M-Type_Attr": 18,
    "Other": 0,
    "S-Date": 4,
    "S-FromAddress": 8,
    "S-ToAddress": 12,
    "S-Type": 16,
    "S-Type_Attr": 20
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 21128
}
